In [7]:
import sys
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

# Load the sql extension for SQL magic
%load_ext sql

# Connect to the PostgreSQL database
%sql postgresql://postgres:berkaper@localhost:5432/contoso_100k

# Enable automatic conversion of SQL results to pandas DataFrames
%config SqlMagic.autopandas = True

# Disable named parameters for SQL magic
%config SqlMagic.named_parameters = "disabled"

# Display pandas number to two decimal places
pd.options.display.float_format = '{:.2f}'.format

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting to 'postgresql://postgres:***@localhost:5432/contoso_100k'

In [8]:
%%sql

SELECT *
FROM sales
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

10 rows affected.

,orderkey,linenumber,orderdate,deliverydate,customerkey,storekey,productkey,quantity,unitprice,netprice,unitcost,currencycode,exchangerate
0,1000,0,2015-01-01,2015-01-01,947009,400,48,1,112.46,98.97,57.34,GBP,0.64
1,1000,1,2015-01-01,2015-01-01,947009,400,460,1,749.75,659.78,382.25,GBP,0.64
2,1001,0,2015-01-01,2015-01-01,1772036,430,1730,2,54.38,54.38,25.00,USD,1.00
3,1002,0,2015-01-01,2015-01-01,1518349,660,955,4,315.04,286.69,144.88,USD,1.00
4,1002,1,2015-01-01,2015-01-01,1518349,660,62,7,135.75,135.75,62.43,USD,1.00
5,1002,2,2015-01-01,2015-01-01,1518349,660,1050,3,499.20,434.30,229.57,USD,1.00
6,1002,3,2015-01-01,2015-01-01,1518349,660,1608,1,65.99,58.73,33.65,USD,1.00
7,1003,0,2015-01-01,2015-01-01,1317097,510,85,3,74.99,74.99,34.48,USD,1.00
8,1004,0,2015-01-01,2015-01-01,254117,80,128,2,114.72,113.57,58.49,CAD,1.16
9,1004,1,2015-01-01,2015-01-01,254117,80,2079,1,499.45,499.45,165.48,CAD,1.16

**Bold text**  
*italic text*  
***Bold and italic text***  
[444](https://www.444.hu)

In [9]:
%%sql

SELECT
    sales.orderdate,
    sales.netprice
FROM sales
WHERE sales.netprice > 100
ORDER BY netprice DESC

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

127089 rows affected.

         orderdate  netprice
0       2015-11-14   6247.50
1       2015-03-07   6247.50
2       2016-08-11   6247.50
3       2017-05-21   6247.50
4       2017-01-26   6247.50
...            ...       ...
127084  2023-02-15    100.05
127085  2022-12-15    100.05
127086  2022-10-01    100.05
127087  2023-02-02    100.05
127088  2023-08-25    100.05

[127089 rows x 2 columns]

In [10]:
%sql SELECT COUNT(*) FROM SALES WHERE sales.quantity > 5;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

1 rows affected.

   count
0  34725

In [11]:
%pwd

'/home/zolcs/JupiterNotebooks/machine_learning/SQL'

In [12]:
%%time
%%sql
SELECT *
FROM product
;

Running query in 'postgresql://postgres:***@localhost:5432/contoso_100k'

2517 rows affected.

CPU times: user 15.9 ms, sys: 0 ns, total: 15.9 ms
Wall time: 18.2 ms